MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX174F256D.PIC
      <edc:SFRDef edc:_addr="0x1F807070" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02472_ppi_pmp16_upb_v1.Module" edc:_refcount="1" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMWADDR" edc:desc="" edc:grp="PMP" edc:impl="0xfcffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------uuxxxxxxxxxxxxxxxxxxxxxx" edc:name="PMWADDR" edc:nzwidth="0x20" edc:por="--------xxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PMP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WADDR" edc:desc="" edc:mask="0xffffff" edc:name="WADDR" edc:nzwidth="24"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="14"/>
            <edc:SFRFieldDef edc:cname="WCS" edc:desc="" edc:mask="0x3" edc:name="WCS" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="WCSA" edc:mask="0x3" edc:name="WCSA" edc:nzwidth="0x2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xe"/>
            <edc:SFRFieldDef edc:cname="WCS1" edc:desc="" edc:mask="0x1" edc:name="WCS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WCS2" edc:desc="" edc:mask="0x1" edc:name="WCS2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="WCS1A" edc:mask="0x1" edc:name="WCS1A" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WCS2A" edc:mask="0x1" edc:name="WCS2A" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="0xe"/>
            <edc:SFRFieldDef edc:cname="WADDR14" edc:desc="" edc:mask="0x1" edc:name="WADDR14" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WADDR15" edc:desc="" edc:mask="0x1" edc:name="WADDR15" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="WADDR22" edc:mask="0x1" edc:name="WADDR22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WADDR23" edc:mask="0x1" edc:name="WADDR23" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F807080" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02472_ppi_pmp16_upb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PMRADDR" edc:desc="" edc:grp="PMP" edc:impl="0xff00ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PMRADDR" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PMP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RADDR" edc:desc="" edc:mask="0x3fff" edc:name="RADDR" edc:nzwidth="14"/>
            <edc:SFRFieldDef edc:cname="RADDR14" edc:desc="" edc:mask="0x1" edc:name="RADDR14" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RADDR15" edc:desc="" edc:mask="0x1" edc:name="RADDR15" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="14"/>
            <edc:SFRFieldDef edc:cname="RCS" edc:desc="" edc:mask="0x3" edc:name="RCS" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xe"/>
            <edc:SFRFieldDef edc:cname="RCS1" edc:desc="" edc:mask="0x1" edc:name="RCS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCS2" edc:desc="" edc:mask="0x1" edc:name="RCS2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F807090" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02472_ppi_pmp16_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMRDIN" edc:desc="" edc:grp="PMP" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PMRDIN" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PMP">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RDATAIN" edc:desc="" edc:mask="0xffffffff" edc:name="RDATAIN" edc:nzwidth="32"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8070A0" edc:offset="8032"/>
      <edc:SFRDef edc:_addr="0x1F809000" edc:_begin="0x0" edc:_end="0x170" edc:_modsrc="DOS-02486_adc_1012_pb_v2.Module" edc:_refcount="1" edc:access="----------------n-n--nnnnnnn-nnc" edc:cname="AD1CON1" edc:desc="" edc:grp="ADC10" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000--0000000-000" edc:name="AD1CON1" edc:nzwidth="0x20" edc:por="----------------000--0000000-000" edc:portals="CLR SET INV" ltx:baseofperipheral="ADC10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="" edc:mask="0x1" edc:name="DONE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SAMP" edc:desc="" edc:mask="0x1" edc:name="SAMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ASAM" edc:desc="" edc:mask="0x1" edc:name="ASAM" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CLRASAM" edc:desc="" edc:mask="0x1" edc:name="CLRASAM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSRC" edc:desc="" edc:mask="0x7" edc:name="SSRC" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="FORM" edc:desc="" edc:mask="0x7" edc:name="FORM" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SSRC0" edc:desc="" edc:mask="0x1" edc:name="SSRC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSRC1" edc:desc="" edc:mask="0x1" edc:name="SSRC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSRC2" edc:desc="" edc:mask="0x1" edc:name="SSRC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FORM0" edc:desc="" edc:mask="0x1" edc:name="FORM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FORM1" edc:desc="" edc:mask="0x1" edc:name="FORM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FORM2" edc:desc="" edc:mask="0x1" edc:name="FORM2" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="ADSIDL" edc:desc="" edc:mask="0x1" edc:name="ADSIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ADON" edc:desc="" edc:mask="0x1" edc:name="ADON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="ADC 1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F809010" edc:_begin="0x0" edc:_end="0x170" edc:_modsrc="DOS-02486_adc_1012_pb_v2.Module" edc:_refcount="1" edc:access="----------------nnnn-n--r-nnnnnn" edc:cname="AD1CON2" edc:desc="" edc:grp="ADC10" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-0--0-000000" edc:name="AD1CON2" edc:nzwidth="0x20" edc:por="----------------0000-0--0-000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADC10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ALTS" edc:desc="" edc:mask="0x1" edc:name="ALTS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUFM" edc:desc="" edc:mask="0x1" edc:name="BUFM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMPI" edc:desc="" edc:mask="0xf" edc:name="SMPI" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="BUFS" edc:desc="" edc:mask="0x1" edc:name="BUFS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CSCNA" edc:desc="" edc:mask="0x1" edc:name="CSCNA" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OFFCAL" edc:desc="" edc:mask="0x1" edc:name="OFFCAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VCFG" edc:desc="" edc:mask="0x7" edc:name="VCFG" edc:nzwidth="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SMPI0" edc:desc="" edc:mask="0x1" edc:name="SMPI0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMPI1" edc:desc="" edc:mask="0x1" edc:name="SMPI1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMPI2" edc:desc="" edc:mask="0x1" edc:name="SMPI2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMPI3" edc:desc="" edc:mask="0x1" edc:name="SMPI3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="VCFG0" edc:desc="" edc:mask="0x1" edc:name="VCFG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VCFG1" edc:desc="" edc:mask="0x1" edc:name="VCFG1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VCFG2" edc:desc="" edc:mask="0x1" edc:name="VCFG2" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
